num = int(input("Введите число от 1 до 1000: "))

ones = ["", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"]
teens = ["десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"]
tens = ["", "", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"]
hundreds = ["", "сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"]


if num < 10:
    print(ones[num])
elif num < 20:
    print(teens[num-10])
elif num < 100:
    print(tens[num//10] + (" "+ones[num%10] if num%10 != 0 else ""))
else:
    print(hundreds[num//100] + (" "+tens[(num%100)//10] if (num%100)//10 != 0 else "") + (" "+ones[num%10] if num%10 != 0 else ""))
    